In [19]:
#Assignment2 Practice

In [20]:
#import libraries
import pandas as pd

In [21]:
#load dataset
df=pd.read_csv('student_dataset.csv',header=0)

In [22]:
df.head() # to print first 5 rows of dataframe

   ID       Name  Age  Marks  Gender
0   1  Student_1   24     94    Male
1   2  Student_2   21     81  Female
2   3  Student_3   22     90    Male
3   4  Student_4   24     56  Female
4   5  Student_5   20     44  Female

In [23]:
df.tail() # to print last 5 rows of dataframe

       ID          Name  Age  Marks  Gender
995   996   Student_996   23     82  Female
996   997   Student_997   18     73  Female
997   998   Student_998   24     96  Female
998   999   Student_999   21     65    Male
999  1000  Student_1000   23     80    Male

In [24]:
df.info() # to get info about dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      1000 non-null   int64
 1   Name    1000 non-null   object
 2   Age     1000 non-null   int64
 3   Marks   1000 non-null   int64
 4   Gender  1000 non-null   object
dtypes: int64(3), object(2)
memory usage: 39.2+ KB

In [25]:
df.describe() # to get statistical summary of dataframe

                ID        Age        Marks
count  1000.000000  1000.0000  1000.000000
mean    500.500000    20.9600    70.232000
std     288.819436     2.0036    17.468638
min       1.000000    18.0000    40.000000
25%     250.750000    19.0000    56.000000
50%     500.500000    21.0000    70.000000
75%     750.250000    23.0000    86.000000
max    1000.000000    24.0000   100.000000

In [26]:
df.columns # to get column names of dataframe

Index(['ID', 'Name', 'Age', 'Marks', 'Gender'], dtype='object')

In [27]:
df.shape # to get shape of dataframe (rows,columns)

(1000, 5)

In [28]:
df.index # to get index of dataframe

RangeIndex(start=0, stop=1000, step=1)

In [29]:
df.isnull().sum() # to check for null values in dataframe

ID        0
Name      0
Age       0
Marks     0
Gender    0
dtype: int64

In [30]:
df.nunique() # to get number of unique values in each column

ID        1000
Name      1000
Age          7
Marks       61
Gender       2
dtype: int64

In [31]:
# to save dataframe to a new csv file
df.to_csv('updated.csv',index=False)

In [32]:
df.dtypes # to get data types of each column in dataframe

ID         int64
Name      object
Age        int64
Marks      int64
Gender    object
dtype: object

In [33]:
print(df.describe()) # to get statistical summary of dataframe
print("\nMean:",df["Marks"].mean()) # to get mean of marks column

                ID        Age        Marks
count  1000.000000  1000.0000  1000.000000
mean    500.500000    20.9600    70.232000
std     288.819436     2.0036    17.468638
min       1.000000    18.0000    40.000000
25%     250.750000    19.0000    56.000000
50%     500.500000    21.0000    70.000000
75%     750.250000    23.0000    86.000000
max    1000.000000    24.0000   100.000000

Mean: 70.232

In [34]:
print("\nMedian:",df["Marks"].median()) # to get median of Marks column

Median: 70.0

In [35]:
print("\nMax Marks:",df["Marks"].max())  # to get max of Marks column 
print("\nMin Marks:",df["Marks"].min())  # to get min of Marks column

Max Marks: 100

Min Marks: 40

In [36]:
print("\nSum of Marks:",df["Marks"].sum())  # to get sum of Marks column    
print("\nCount of Marks:",df["Marks"].value_counts())  # to get count of unique values in Marks column

Sum of Marks: 70232

Count of Marks: Marks
65    28
90    27
86    26
76    23
79    23
      ..
80    10
66    10
97    10
55     9
87     8
Name: count, Length: 61, dtype: int64